<?php
/**
 * Core file.
 *
 * @author Vince Wooll <sales@jomres.net>
 *
 * @version Jomres 9.24.0
 *
 * @copyright	2005-2021 Vince Wooll
 * Jomres (tm) PHP, CSS & Javascript files are released under both MIT and GPL2 licenses. This means that you can choose the license that best suits your project, and use it accordingly
 **/
//#################################################################
defined('_JOMRES_INITCHECK') or die('');
//#################################################################

jr_define('_JRPORTAL_UNPAID_BOOKINGS_TITLE',"Обработка на неплатени резервации");
jr_define('_JRPORTAL_UNPAID_BOOKINGS_DELETEORCANCEL',"Да анулирате или изтриете временните (неплатени) резервации? ");
jr_define('_JRPORTAL_UNPAID_BOOKINGS_NR_DAYS_TITLE',"Определете колко дни от времето за резервация? ");
jr_define('_JRPORTAL_UNPAID_BOOKINGS_INSTRUCTIONS',"Тази плъгин работи автоматично на заден план и изтрива или анулира всички временни резервации, които не са маркирани като платени в рамките на интервал по ваш избор. Това е полезно, когато приемате резервации, които се плащат с офлайн методи на плащане (банков трансфер, чек). Ако резервация не бъде платена в рамките на X брой дни от момента на извършване на резервацията, резервацията се изтрива или анулира и календарът ще покаже резервираните дати като налични, така че някой друг може да резервира тези дни . Когато резервация бъде изтрита или анулирана, вие и гостът ще получите известие по имейл. Ако изберете да анулирате резервация, тогава резервацията и фактурата й ще бъдат маркирани като анулирани и няма да бъдат изтрити от базата данни , за да имате достъп до тях по-късно. Ако изберете да го изтриете, резервацията и фактурата й ще бъдат изтрити от базата данни.");
jr_define('_JRPORTAL_UNPAID_BOOKINGS_EMAIL_TITLE',"Резервацията е анулирана");
jr_define('_JOMRES_EMAIL_CANCEL_BOOKING_MSGBODY1',"Резервацията ви беше автоматично анулирана поради неплащане на необходимия депозит. Това вече не е валидна резервация. Ако искате да резервирате отново, моля, посетете нашия уебсайт и повторете резервацията. Следват подробности за анулирана резервация.");
jr_define('_JOMRES_EMAIL_CANCEL_BOOKING_MSGBODY2',"Ако смятате, че сте получили това известие по погрешка, моля, не се колебайте да се свържете с нас.");