<?php
/**
 * Core file.
 *
 * @author Vince Wooll <sales@jomres.net>
 *
 * @version Jomres 9.24.0
 *
 * @copyright	2005-2021 Vince Wooll
 * Jomres is currently available for use in all personal or commercial projects under both MIT and GPL2 licenses. This means that you can choose the license that best suits your project, and use it accordingly
 **/
//#################################################################
defined('_JOMRES_INITCHECK') or die('');
//#################################################################
jr_define('_JRPORTAL_UNPAID_BOOKINGS_TITLE',"Χειρισμός κρατήσεων χωρίς πληρωμή");
jr_define('_JRPORTAL_UNPAID_BOOKINGS_DELETEORCANCEL',"Ακύρωση ή διαγραφή των προσωρινών (χωρίς πληρωμή) κρατήσεων; ");
jr_define('_JRPORTAL_UNPAID_BOOKINGS_NR_DAYS_TITLE',"Αλλά πόσες ημέρες από την ώρα κράτησης; ");
jr_define('_JRPORTAL_UNPAID_BOOKINGS_INSTRUCTIONS',"Αυτή η προσθήκη εκτελείται αυτόματα στο παρασκήνιο και διαγράφει ή ακυρώνει όλες τις προσωρινές κρατήσεις που δεν έχουν επισημανθεί ως επί πληρωμή εντός ενός διαστήματος της επιλογής σας. Αυτό είναι χρήσιμο όταν αποδέχεστε κρατήσεις που πληρώνονται χρησιμοποιώντας μεθόδους πληρωμής εκτός σύνδεσης (wire μεταφορά, επιταγή). Εάν μια κράτηση δεν πληρωθεί εντός Χ αριθμού ημερών από τη στιγμή που έγινε η κράτηση, τότε η κράτηση διαγράφεται ή ακυρώνεται και το ημερολόγιο θα εμφανίζει τις ημερομηνίες κράτησης ως διαθέσιμες, ώστε κάποιος άλλος να μπορεί να κάνει κράτηση για αυτές τις ημέρες . Όταν μια κράτηση διαγραφεί ή ακυρωθεί, τόσο εσείς όσο και ο επισκέπτης θα λάβετε μια ειδοποίηση μέσω email. Εάν επιλέξετε να ακυρώσετε μια κράτηση, τότε η κράτηση και το τιμολόγιο θα επισημανθούν ως ακυρωμένα και δεν θα διαγραφούν από τη βάση δεδομένων , ώστε να έχετε πρόσβαση αργότερα. Εάν επιλέξετε να το διαγράψετε, τότε η κράτηση και το τιμολόγιο θα διαγραφούν από τη βάση δεδομένων.");
jr_define('_JRPORTAL_UNPAID_BOOKINGS_EMAIL_TITLE',"Η κράτηση ακυρώθηκε");
jr_define('_JOMRES_EMAIL_CANCEL_BOOKING_MSGBODY1',"Η κράτησή σας ακυρώθηκε αυτόματα λόγω μη πληρωμής της απαιτούμενης κατάθεσης. Αυτή δεν είναι πλέον έγκυρη κράτηση. Εάν θέλετε να κάνετε ξανά κράτηση, επισκεφτείτε τον ιστότοπό μας και επαναλάβετε την κράτηση. Ακολουθούν λεπτομέρειες κράτησης που ακυρώθηκε.");
jr_define('_JOMRES_EMAIL_CANCEL_BOOKING_MSGBODY2',"Εάν πιστεύετε ότι λάβατε αυτήν την ειδοποίηση κατά λάθος, μη διστάσετε να επικοινωνήσετε μαζί μας.");