<?php
/**
 * Core file
 *
 * @author Vince Wooll <sales@jomres.net>
 * @version Jomres 9.24.0
 * @package Jomres
 * @copyright	2005-2021 Vince Wooll
 * Jomres (tm) PHP, CSS & Javascript files are released under both MIT and GPL2 licenses. This means that you can choose the license that best suits your project, and use it accordingly.
 **/
##################################################################
defined( '_JOMRES_INITCHECK' ) or die( '' );
##################################################################

jr_define('_JRPORTAL_UNPAID_BOOKINGS_TITLE',"การจัดการการจองที่ยังไม่ได้ชำระเงิน");
jr_define('_JRPORTAL_UNPAID_BOOKINGS_DELETEORCANCEL',"ยกเลิกหรือลบการจองชั่วคราว (ค้างชำระ) หรือไม่ ");
jr_define('_JRPORTAL_UNPAID_BOOKINGS_NR_DAYS_TITLE',"กำหนดระยะเวลาจองได้กี่วัน");
jr_define('_JRPORTAL_UNPAID_BOOKINGS_INSTRUCTIONS',"ปลั๊กอินนี้ทำงานโดยอัตโนมัติในพื้นหลัง และลบหรือยกเลิกการจองชั่วคราวทั้งหมดที่ไม่ได้ทำเครื่องหมายว่าชำระเงินภายในช่วงเวลาที่คุณเลือก ซึ่งจะมีประโยชน์เมื่อคุณยอมรับการจองที่ชำระเงินโดยใช้วิธีการชำระเงินออฟไลน์ (โอนเงินผ่านธนาคาร) โอน, เช็ค) หากการจองไม่ชำระเงินภายใน X จำนวนวันนับจากเวลาที่จองการจองนั้นจะถูกลบหรือยกเลิกการจองและปฏิทินจะแสดงวันที่จองเป็นว่างเพื่อให้บุคคลอื่นสามารถจองวันเหล่านั้นได้ เมื่อการจองถูกลบหรือยกเลิกการจอง ทั้งคุณและแขกจะได้รับการแจ้งเตือนทางอีเมล หากคุณเลือกยกเลิกการจอง การจองและใบแจ้งหนี้จะถูกทำเครื่องหมายเป็นยกเลิกและจะไม่ถูกลบออกจากฐานข้อมูล เพื่อให้คุณสามารถเข้าถึงได้ในภายหลัง หากคุณเลือกที่จะลบ การจองและใบแจ้งหนี้จะถูกลบออกจากฐานข้อมูล");
jr_define('_JRPORTAL_UNPAID_BOOKINGS_EMAIL_TITLE',"การจองถูกยกเลิก");
jr_define('_JOMRES_EMAIL_CANCEL_BOOKING_MSGBODY1',"การจองของคุณถูกยกเลิกโดยอัตโนมัติเนื่องจากไม่ได้ชำระเงินมัดจำ นี่ไม่ใช่การจองที่ถูกต้องอีกต่อไป หากคุณต้องการจองอีกครั้ง โปรดไปที่เว็บไซต์ของเราและทำการจองอีกครั้ง ต่อไปนี้เป็น รายละเอียดการจองที่ถูกยกเลิก");
jr_define('_JOMRES_EMAIL_CANCEL_BOOKING_MSGBODY2',"หากคุณรู้สึกว่าคุณได้รับการแจ้งเตือนนี้โดยไม่ได้ตั้งใจ โปรดอย่าลังเลที่จะติดต่อเรา");