<?php
/**
 * Core file.
 *
 * @author Vince Wooll <sales@jomres.net>
 *
 * @version Jomres 9.24.0
 *
 * @copyright	2005-2021 Vince Wooll
 * Jomres is currently available for use in all personal or commercial projects under both MIT and GPL2 licenses. This means that you can choose the license that best suits your project, and use it accordingly
 **/
//#################################################################
defined('_JOMRES_INITCHECK') or die('');
// Because the server may be using a proxy for outgoing calls it's better to call the Jomres App server and ask it to respond with this server's IP address. Once we know that, then we are able to give the documentation the correct IP number to configure in Beds24's API Key N field(s)
$cURLConnection = curl_init();

curl_setopt($cURLConnection, CURLOPT_URL, 'https://api.ipify.org?format=json');
curl_setopt($cURLConnection, CURLOPT_RETURNTRANSFER, true);
curl_setopt($cURLConnection, CURLOPT_CONNECTTIMEOUT, 1);
curl_setopt($cURLConnection, CURLOPT_TIMEOUT, 1);

$ip_number_response = curl_exec($cURLConnection);
curl_close($cURLConnection);

$jsonArrayResponse = json_decode($ip_number_response);

if (isset( $jsonArrayResponse->ip)) {
    $this_servers_ip_number = $jsonArrayResponse->ip;
} else {
    $this_servers_ip_number = 'Unknown, ask your server hosts support team';
}

jr_define ("BEDS24V2_CHANNEL_MANAGEMENT", "Διαχείριση καναλιών (Beds24)");

jr_define ('BEDS24V2_WEBHOOKS_AUTH_METHOD', 'Beds24');
jr_define ('BEDS24V2_WEBHOOKS_AUTH_METHOD_NOTES', 'Εάν διαθέτετε λογαριασμό στο Beds24 και θέλετε να ενημερώσετε το Beds24 όταν κάνετε κράτηση, επιλέξτε αυτήν την επιλογή. Ορίστε τη διεύθυνση URL σε https://www.beds24.com/api/json/');
jr_define ('BEDS24V2_ERROR_USER_NO_KEY', 'Αυτός ο χρήστης δεν έχει ορίσει κλειδιά API, επομένως δεν μπορεί να συνεχίσει. Επισκεφτείτε τη σελίδα του στη σελίδα Διαχείριση χρηστών> Διαχειριστές ιδιοκτησίας και δημιουργήστε ένα νέο κλειδί API για αυτούς χρησιμοποιώντας τον σύνδεσμο που παρέχεται σε αυτήν τη σελίδα.');
jr_define ('BEDS24V2_ERROR_USER_NO_PROPERTIES', 'Αυτός ο χρήστης δεν έχει ιδιότητες Jomres που μπορεί να εκχωρήσει σε ιδιότητες Beds24 ή αντίστροφα');
jr_define ('BEDS24V2_NOT_SUBSCRIBED', "Ο διαχειριστής στον οποίο είστε συνδεδεμένοι δεν φαίνεται να έχει λογαριασμό στο Beds24, οπότε θα πρέπει πρώτα να εγγραφείτε για την υπηρεσία του και στη συνέχεια να αποθηκεύσετε αυτό το κλειδί API σε <a href = 'https://www.beds24.com/control2.php?pagetype=accountpassword' target='_blank'> Ο ιστότοπος του Beds24 εδώ. </a> ");
jr_define ('BEDS24V2_NOT_SUBSCRIBED_KEY', "Αντιγράψτε και επικολλήστε αυτό το κλειδί API στο πεδίο LINK στο λογαριασμό σας στο Beds24 για να συνεχίσετε.");
jr_define ('BEDS24V2_NOT_SUBSCRIBED_RELOAD', "Όταν το κάνετε αυτό, κάντε κλικ στο παρακάτω κουμπί για να συνεχίσετε.");
jr_define ('BEDS24V2_DISPLAY_PROPERTIES_TITLE', "Σύνδεση ιδιοκτησίας Beds24");
jr_define ('BEDS24V2_DISPLAY_PROPERTIES_INFO', "Αυτή η σελίδα σάς επιτρέπει να δείτε τις ιδιότητες στις οποίες έχετε πρόσβαση σε αυτό το σύστημα, καθώς και αυτές που υπάρχουν στο Διαχειριστή καναλιών. Σας επιτρέπει επίσης να εισάγετε ιδιότητες από το Διαχειριστή καναλιών σε αυτό το σύστημα ή να εξάγετε υπάρχουσες ιδιότητες στον Διαχειριστή καναλιών. <br/> Εάν έχετε ιδιότητες τόσο σε αυτό το σύστημα όσο και στο Beds24 και θέλετε να τις συνδέσετε μεταξύ σας, μπορείτε να χρησιμοποιήσετε το apikey ιδιοτήτων για να το κάνετε αυτό. Επισκεφτείτε το Beds24> Ρυθμίσεις> Ιδιότητες (βεβαιωθείτε ότι η ιδιότητα που έχει επιλεγεί στο αναπτυσσόμενο μενού είναι η ίδια με αυτήν που θέλετε να συνδέσετε), στη συνέχεια στο υπομενού Σύνδεσμος αποθηκεύστε την \"ιδιότητα apikey\" στο πεδίο \"propKey\" στο Beds24. Μόλις το κάνετε αυτό, φορτώστε ξανά τη σελίδα. Αυτό το σύστημα θα δείτε ότι οι δύο ιδιότητες συσχετίζονται με το ίδιο κλειδί και δημιουργούν τις απαραίτητες συσχετίσεις. Μόλις συνδεθούν οι δύο ιδιότητες, θυμηθείτε να επισκεφθείτε τη σελίδα \"Ιδιότητα προβολής\", να βρείτε το url ειδοποίησης και να το επικολλήσετε στο πεδίο Σύνδεση \"Ειδοποίηση διεύθυνσης URL\". Που θα βεβαιωθείτε ότι το Beds24 χρησιμοποιεί τον σωστό σύνδεσμο για να συγχρονίσει τις κρατήσεις με αυτήν την ιδιότητα όταν λαμβάνει κρατήσεις. ");
jr_define ('BEDS24V2_DISPLAY_PROPERTIES_NO_PROPERTIES', "Σφάλμα: Δεν υπάρχουν ιδιότητες στις οποίες μπορείτε να συνδέσετε στο Beds24. Αυτό μπορεί να οφείλεται στο γεγονός ότι όλες οι ιδιότητες που έχετε δικαιώματα να έχουν ήδη συνδεθεί με έναν άλλο λογαριασμό σε αυτό το σύστημα.");
jr_define ("BEDS24V2_DISPLAY_PROPERTIES_PROPERTY_UID", "ιδιότητα uid");
jr_define ('BEDS24V2_DISPLAY_PROPERTIES_PROPERTY_NAME', "Όνομα ιδιοκτησίας");
jr_define ("BEDS24V2_DISPLAY_PROPERTIES_BEDS24_PROPERTY_UID", "Beds24 Property Uid");
jr_define ('BEDS24V2_DISPLAY_PROPERTIES_BEDS24_PROPERTY_NAME', "Όνομα ιδιοκτησίας Beds24");
jr_define ("BEDS24V2_DISPLAY_PROPERTY_APIKEY", "Ακίνητα ιδιοκτησίας");
jr_define ("BEDS24_LISTPROPERTIES_IMPORT", "Εισαγωγή");
jr_define ('BEDS24_LISTPROPERTIES_ASSOCIATE_ROOM_TYPES', "Διαμόρφωση τύπων δωματίων");
jr_define ('BEDS24_LISTPROPERTIES_ASSOCIATE_ROOM_TYPES_DESC', "Εδώ πρέπει να συνδέσετε τύπους δωματίων στο λογαριασμό σας στο Beds24 με αυτούς που είναι αποθηκευμένοι σε αυτό το σύστημα.");
jr_define ('_BEDS24_DISPLAY_BOOKINGS_JOMRESROOMS_BEDS24TYPENAME', "τύπος δωματίου Beds24");

jr_define ('BEDS24_LISTPROPERTIES_IMPORT_CANNOT_NOAPIKEY', "Δεν είναι δυνατή η εισαγωγή αυτής της ιδιότητας, καθώς δεν έχετε ορίσει το κλειδί ιδιοτήτων στη σελίδα\"Σύνδεσμος ιδιοτήτων ").
jr_define ('BEDS24_LISTPROPERTIES_IMPORT_CANNOT_NOROOMS', "Δεν είναι δυνατή η εισαγωγή αυτής της ιδιοκτησίας, καθώς δεν έχει δωμάτια. Δημιουργήστε ένα ή περισσότερα δωμάτια (τα δωμάτια στο Beds24 είναι ίδια με τους τύπους δωματίων στο Jomres) και μην ξεχάσετε να ορίσετε την ελάχιστη τιμή . Μόλις το κάνετε αυτό, μπορείτε να εισαγάγετε τον τύπο δωματίου στο Jomres και να τον συσχετίσετε με τωρινούς τύπους δωματίων Jomres. Μετά από αυτό, θα μπορείτε να τροποποιήσετε τα τιμολόγια, αλλά πρέπει να οριστεί μια ελάχιστη τιμή. ");
jr_define ('_BEDS24_SUGGESTED_KEY', "Σας προτείνουμε να χρησιμοποιήσετε αυτό το κλειδί API. Όταν το κάνετε αυτό, φορτώστε ξανά αυτήν τη σελίδα.");
jr_define ('BEDS24_LISTPROPERTIES_EXPORT', "Εξαγωγή");
jr_define ('BEDS24V2_REST_API_INTRO', "Εδώ μπορείτε να δείτε το ζεύγος κλειδιών REST API και τη διαδρομή προς το API. Εάν αποθηκεύσετε αυτές τις λεπτομέρειες στο λογαριασμό σας στο Beds24, τότε το Beds24 24 θα μπορεί να επικοινωνήσει με αυτόν τον ιστότοπο μέσω του API του.");
jr_define ('BEDS24V2_REST_API_CLIENT_ID', "Client ID");
jr_define ('BEDS24V2_REST_API_CLIENT_SECRET', "Client Secret");
jr_define ('BEDS24V2_REST_API_ENDPOINT', "URI (τελικό σημείο)");
jr_define ('BEDS24_LISTPROPERTIES_CONFIGURE', "Προβολή ιδιοκτησίας");
jr_define ('BEDS24_ROOM_TYPES_TITLE', "Συσχετίσεις τύπου δωματίου");
    
jr_define ('BEDS24_ROOM_TYPES_INFO', "Αυτή η σελίδα σάς επιτρέπει να συσχετίσετε τους τύπους δωματίων σας με αυτούς που είναι αποθηκευμένοι στους διακομιστές Beds24.");
jr_define ('BEDS24_ROOM_TYPES_INFO2', "Μέχρι να συνδεθούν οι τύποι δωματίων, δεν μπορείτε να λάβετε πληροφορίες κράτησης που αποστέλλονται από το Beds24. Εάν η ιδιοκτησία σας έχει εισαχθεί/εξαχθεί προς ή από το Beds24, τότε έχουμε δημιουργήσει αυτόματα συνδέσμους για εσάς, ωστόσο αν προσθέσετε νέο τύπο δωματίου ή διαγράψτε ένα, τότε αυτή η σελίδα μπορεί να χρησιμοποιηθεί για να διασφαλίσετε ότι ο τύπος δωματίου είναι σωστά συνδεδεμένος. ");
jr_define ('BEDS24_ROOM_TYPES_INFO3', "Επιλέξτε τους τύπους δωματίων Beds24 που θέλετε να συσχετίσετε με τους τύπους δωματίων σε αυτό το σύστημα και όταν τελειώσετε κάντε κλικ στην επιλογή Αποθήκευση για να ενημερώσετε τις αλλαγές στο Beds24.");
jr_define ('BEDS24_ROOM_TYPES_YOURS', "Οι τύποι δωματίων σας");
jr_define ('BEDS24_ROOM_TYPES_BEDS24', "Τύποι δωματίων Beds24");
jr_define ('BEDS24_ROOM_TYPES_NONE', "Αυτή η ιδιότητα δεν έχει τύπους δωματίων, επομένως δεν μπορεί να συνδεθεί με κανέναν τύπο δωματίου Beds24. Θέλετε να εισαγάγετε τύπους δωματίων από το Beds24;");
jr_define ('BEDS24_IMPORT_ROOMS', "Εισαγωγή δωματίων");
jr_define ("BEDS24_EXPORT_BOOKINGS", "Εξαγωγή κρατήσεων");
jr_define ("BEDS24_IMPORT_BOOKINGS", "Εισαγωγή κρατήσεων");
jr_define ('BEDS24_IMPORT_EXPORT', "Μπορείτε να εισαγάγετε και να εξάγετε υπάρχουσες κρατήσεις από και προς το Beds24 με ένα κλικ. Οι κρατήσεις που εισάγονται από το Beds24 εισάγονται από χθες και θα περιλαμβάνουν όλες τις κρατήσεις του επόμενου έτους. Θα πρέπει να χρησιμοποιήσετε αυτά τα κουμπιά μόνο μετά πρώτα εισαγωγή ή εξαγωγή της ιδιοκτησίας στο σύστημα. Μόλις εγκατασταθεί, η εισαγωγή και/ή η εξαγωγή θα γίνουν αυτόματα. ");
jr_define ('_BEDS24_CHANNEL_MANAGEMENT_UPDATE_PRICING_YESNO', "Ενημέρωση τιμών στο Beds24;");
jr_define ('_BEDS24_CHANNEL_MANAGEMENT_UPDATE_PRICING_YESNO_DESC', "Μπορείτε να επιλέξετε να ενημερώσετε το Beds24 μόνο με διαθεσιμότητα ή με διαθεσιμότητα και τιμές. Εάν χρησιμοποιείτε συγκεκριμένες καταστάσεις όπου θέλετε να χρησιμοποιήσετε τον πίνακα ελέγχου Beds24 για τον καθορισμό συγκεκριμένων τιμών για συγκεκριμένα κανάλια, πρέπει να το αφήσετε σε Οχι.");
jr_define ('_BEDS24_CONTROL_PANEL_DIRECT', "Άμεσος σύνδεσμος");
jr_define ('BEDS24_IMPORT_NOTIFICATION_URLS', "Εάν εισαγάγατε αυτήν την ιδιότητα στο Jomres, θα πρέπει να αλλάξετε μη αυτόματα το URL ειδοποίησης στο Beds24 σας -> Ιδιότητα -> Ρυθμίσεις συνδέσμου στα ακόλουθα:");
jr_define ('BEDS24V2_ERROR_KEYS_SHOULD_BE_REGENERATED', "Δεν έχετε προς το παρόν ιδιότητες που σχετίζονται με τις ιδιότητες του Beds24. Πρέπει να επαναφέρετε τα κλειδιά API του διαχειριστή σας προτού επιτρέψετε στους διαχειριστές σας να επιχειρήσουν να συνδεθούν με το Beds24. Αυτό θα διασφαλίσει ότι όλα έχουν μοναδικά κλειδιά.");
jr_define ('BEDS24V2_ERROR_KEYS_REBUILD', "Επαναφορά κλειδιών API διαχειριστή τώρα");
jr_define ('BEDS24V2_ERROR_KEYS_DISMISS', "Αγνοήστε την προειδοποίηση");
jr_define ('BEDS24V2_ERROR_KEYS_DONE', "Τα κλειδιά API διαχειριστή έχουν επαναφερθεί");

jr_define ('BEDS24V2_ADMINISTRATOR_LINKS_TITLE', "Σύνδεσμοι ιδιοκτησίας Beds24");
jr_define ("BEDS24_ASSIGN_MANAGER", "Beds24 Change Manager");
jr_define ('BEDS24_ASSIGN_MANAGER_DESC', "Όταν ένας διαχειριστής βλέπει τη σελίδα Διαχείριση καναλιών (Bed24) στο προσκήνιο, όλες οι ιδιότητες που μοιράζονται ένα κλειδί API τόσο στο Jomres όσο και στο Beds24 συνδέονται αυτόματα στο Jomres. Ομοίως, οποιεσδήποτε ιδιότητες εισάγονται ή εξάγονται από τον διαχειριστή είναι συνδεδεμένοι. Μπορείτε να αλλάξετε τον διαχειριστή με τον οποίο είναι συνδεδεμένη μια ιδιότητα, αλλάζοντας το αναπτυσσόμενο μενού διαχειριστή σε αυτήν τη σελίδα και, στη συνέχεια, κάνοντας κλικ στην επιλογή Αποθήκευση. ");
jr_define ("BEDS24V2_TARIFFS_TITLE", "Δασμολογική εξαγωγή");
jr_define( 'BEDS24V2_TARIFF_EXPORT_DESC', "Μπορείτε να εξάγετε τα τιμολόγια που έχετε δημιουργήσει στο Beds24 σε μια συγκεκριμένη ημερήσια τιμή. Εάν πρόκειται να χρησιμοποιήσετε αυτήν τη δυνατότητα, πρέπει να ορίσετε την επιλογή \"Ενημέρωση τιμών σε Beds24\" επιλογή στο Property Configuration to No. Μπορεί επίσης να χρειαστεί να ρυθμίσετε τις παραμέτρους της ιδιοκτησίας σας στον πίνακα ελέγχου Beds24, ώστε να μπορείτε να έχετε πολλαπλές ημερήσιες τιμές. Για να το κάνετε αυτό, μεταβείτε στις Ρυθμίσεις> Ιδιότητες> Δωμάτια> Ημερήσιες τιμές και διαμορφώστε τον \"Αριθμό ημερήσιων τιμών\" στον αριθμό των τιμών που θέλετε. Μόλις το κάνετε αυτό, θα μπορείτε να κάνετε κλικ σε ένα από τα κουμπιά P για να ορίσετε αυτήν την ημερήσια τιμή." );
jr_define ('BEDS24V2_TARIFF_EXPORT_TARIFFNAME', "Όνομα τιμολογίου");
jr_define ('BEDS24V2_TARIFF_EXPORT_TARIFF_ROOM_TYPE', "Τύπος δωματίου");
jr_define ("BEDS24V2_BOOKING_RESEND", "Επανάληψη αποστολής ειδοποίησης");
jr_define ('BEDS24V2_BOOKING_DATA_AT_B24', "Αυτές είναι οι πληροφορίες κράτησης που αποθηκεύονται στο Beds24. Εκτός αν είστε βέβαιοι ότι τα δεδομένα είναι λανθασμένα, δεν χρειάζεται να στείλετε ξανά την κράτηση στο Beds24.");
jr_define ('BEDS24V2_BOOKING_NO_DATA_AT_B24', "Αυτή η κράτηση δεν φαίνεται να σχετίζεται με κράτηση στο Beds24. Μπορείτε να χρησιμοποιήσετε το κουμπί Επανάληψη αποστολής για να εξάγετε αυτήν την κράτηση σε κρεβάτια24.");

jr_define ('BEDS24V2_GDPR_ANONYMISE_GUESTS', "Ανώνυμος επισκέπτης;");
jr_define ("BEDS24V2_GDPR_ANONYMISE_GUESTS_DESC", "Όταν οι κρατήσεις αποστέλλονται στον διαχειριστή καναλιού, συνιστούμε να ανωνυμοποιήσετε τα στοιχεία του επισκέπτη. Εάν ορίσετε αυτήν την επιλογή σε ναι, όταν οι πληροφορίες κράτησης αποστέλλονται στον διαχειριστή καναλιού, το όνομα του επισκέπτη, η διεύθυνση ηλεκτρονικού ταχυδρομείου δεν είναι . Οι OTA θα έχουν ακριβή καταγραφή της διαθεσιμότητάς σας χωρίς να χρειάζεται να μοιραστείτε περισσότερες πληροφορίες από τις απαραίτητες. Αυτό σημαίνει ότι συμμορφώνεστε με τον GDPR, επειδή εάν ο επισκέπτης επιλέξει αργότερα να διαγράψει τα στοιχεία του σε αυτό το σύστημα (δεν θα ειδοποιηθείτε όταν συμβαίνει), τα στοιχεία τους δεν αφήνονται με άλλους υπεύθυνους επεξεργασίας δεδομένων στους οποίους δεν έχετε κανέναν έλεγχο. Εάν χρειαστεί, μπορείτε ακόμα να διασταυρώσετε κρατήσεις σε αυτό το σύστημα με αυτές του διαχειριστή καναλιού, στη σελίδα Λεπτομέρειες κράτησης θα εμφανιστεί ο αριθμός κράτησης για Αυτή η κράτηση είναι αποθηκευμένη στο διαχειριστή καναλιού. ");
jr_define ("BEDS24V2_MASTER_APIKEY", "ΠΕΙΡΑΜΑΤΙΚΟ ΧΑΡΑΚΤΗΡΙΣΤΙΚΟ - Κλειδί API Master Beds24");
jr_define ("BEDS24V2_MASTER_APIKEY_DESC", "ΕΑΝ ΕΧΕΤΕ ΑΚΟΜΑ ΕΓΚΑΤΑΣΤΑΣΗ ΤΖΟΜΡΕΣ ΜΕ ΙΔΙΕΣ ΣΥΝΔΕΔΕΜΕΝΕΣ ΣΤΟ BEDS24 ΔΙΑΒΑΣΤΕ ΟΛΗ ΤΗΝ ΠΕΡΙΓΡΑΦΗ ΕΔΩ. Από προεπιλογή, η Jomres είναι σχεδιασμένη για τους λογαριασμούς πολλαπλών πωλητών τους ιδιότητες από και προς κρεβάτια24 με ασφάλεια. Αυτή η ρύθμιση σάς επιτρέπει να παρακάμψετε αυτήν τη λειτουργικότητα έχοντας ένα μόνο κλειδί api για όλες τις ιδιότητες. Αυτό σημαίνει ότι χρειάζεστε μόνο έναν λογαριασμό στο Beds24, ωστόσο σημαίνει επίσης ότι όλες οι χρεώσεις θα συγκεντρωθούν από αυτόν τον λογαριασμό. Οποιοσδήποτε διαχειριστής με πρόσβαση σε μια ιδιότητα θα μπορεί να στέλνει ενημερώσεις στην ιδιοκτησία στους διακομιστές bed24. Αφήστε κενό για να αγνοήσετε αυτήν τη ρύθμιση και να αναγκάσετε τους διαχειριστές ιδιοκτησίας να χρησιμοποιήσουν τους δικούς τους λογαριασμούς Beds24. Το κλειδί API μπορεί να έχει οποιαδήποτε μορφή θέλετε, για πολύ καιρό καθώς το κλειδί εδώ ταιριάζει με αυτό στο <a href='https://www.beds24.com/control2.php?pagetype=accountpassword' target='_blank'> <em> Κλειδί API 1 </em> </ a> πεδίο. ΑΝ ΕΧΕΤΕ ΗΔΗ ΕΓΚΑΤΑΣΤΑΣΗ ΣΤΙΣ ΤΖΟΜΡΕΣ ΜΕ ΙΔΙΟΤΗΤΕΣ ΣΥΝΔΕΔΕΜΕΝΕΣ ΣΤΟ BEDS24: Μπορείτε να μεταβείτε στη χρήση αυτής της δυνατότητας, ωστόσο θα χρειαστεί να περικόψετε (αδειάσετε) πρώτα αυτούς τους πίνακες, να διαγράψετε τις υπάρχουσες ιδιότητες που βρίσκονται ήδη στο Jomres και, στη συνέχεια, να εισαγάγετε ξανά τις ιδιότητες από το Beds24 στο Jomres. XXXXX_jomres_beds24_contract_booking_number_xref, XXXXX_jomres_beds24_property_uid_xref, XXXXX_jomres_beds24_rest_api_key_xref, XXXXX_jomres_beds24_room_type_xref. <br/> <br/> Κατά τη ρύθμιση του κλειδιού API στην ενότητα <em> Κλειδί API N </em> της σελίδας πρόσβασης λογαριασμού του Beds24, είναι ζωτικής σημασίας να ορίσετε το πεδίο <em> Πρόσβαση κλειδιού API </em> σε ' Να επιτρέπεται μόνο η IP της λίστας επιτρεπόμενων \"και ορίζετε τον αριθμό IP σε <strong>". $this_servers_ip_number. "</strong> Αυτό ισχύει εξίσου για τη διαμόρφωση του βασικού κλειδιού API εδώ, και στο προσκήνιο εάν ένας διαχειριστής ιδιοκτησίας διαμορφώνει το δικό του ατομικό API κλειδιά. ");
jr_define ('BEDS24V2_WHITELIST_WARNING', "Εάν οι ιδιότητές σας έχουν ήδη συνδεθεί με το Beds24, λάβετε υπόψη ότι το Beds24 έχει εισαγάγει πρόσφατα μια πολιτική όπου όλοι οι διακομιστές που συνδέονται με τον λογαριασμό σας πρέπει να έχουν επισημανθεί. Μπορείτε να το κάνετε αυτό στη σελίδα Πρόσβαση λογαριασμού, όπου το κλειδί πρόσβασής σας έχει εισαχθεί. Επιλέξτε το αναπτυσσόμενο μενού IP Λίστας και ορίστε τον αριθμό IP σε ");