<?php
/**
 * Core file.
 *
 * @author Vince Wooll <sales@jomres.net>
 *
 * @version Jomres 9.24.0
 *
 * @copyright	2005-2021 Vince Wooll
 * Jomres (tm) PHP, CSS & Javascript files are released under both MIT and GPL2 licenses. This means that you can choose the license that best suits your project, and use it accordingly
 **/
//#################################################################
defined('_JOMRES_INITCHECK') or die('');
//#################################################################
jr_define ('_JOMRES_AJAX_SEARCH_COMPOSITE_TITLE', "Ajax Search Composite");
jr_define ('_JOMRES_AJAX_SEARCH_COMPOSITE_BYSTARS', "Търсене по звезди");
jr_define ('_JOMRES_AJAX_SEARCH_COMPOSITE_BYPRICES', "Търсене по цени");
jr_define ('_JOMRES_AJAX_SEARCH_COMPOSITE_BYFEATURES', "Търсене по функции");
jr_define ('_JOMRES_AJAX_SEARCH_COMPOSITE_BYCOUNTRY', "Търсене по държава");
jr_define ('_JOMRES_AJAX_SEARCH_COMPOSITE_BYREGION', "Търсене по региони");
jr_define ('_JOMRES_AJAX_SEARCH_COMPOSITE_BYTOWN', "Търсене по град");
jr_define ('_JOMRES_AJAX_SEARCH_COMPOSITE_BYROOMTYPE', "Търсене по тип стая");
jr_define ('_JOMRES_AJAX_SEARCH_COMPOSITE_BYPROPERTYTYPE', "Търсене по тип собственост");
jr_define ('_JOMRES_AJAX_SEARCH_COMPOSITE_BYGUESTNUMBER', "Търсене по номера на гости");
jr_define ('_JOMRES_AJAX_SEARCH_COMPOSITE_BYDATES', "Търсене по дати");
jr_define ('_JOMRES_AJAX_SEARCH_COMPOSITE_TEMPLATE_TITLE', "Стил на шаблона");
jr_define ('_JOMRES_AJAX_SEARCH_COMPOSITE_TEMPLATE_DESC', "По подразбиране: Предимно прости квадратчета или бутони, ако са в Bootstrap. Модали: Бутоните се отварят, за да позволят на потребителите да избират филтри за търсене. Акордеон, предназначен за горната част на страницата, областите се плъзгат надолу, за да разкрият филтри. Мултиселектиране: Бутони падащи разкриване на филтри. ");
jr_define ('_JOMRES_AJAX_SEARCH_COMPOSITE_TEMPLATE_BUTTONS', "Бутони (вертикална ориентация)");
jr_define ('_JOMRES_AJAX_SEARCH_COMPOSITE_TEMPLATE_MODALS', "Модали (вертикална ориентация) само Bootstrap.");
jr_define ('_JOMRES_AJAX_SEARCH_COMPOSITE_TEMPLATE_ACCORDION', "Акордеон (хоризонтална ориентация) само Bootstrap.");
jr_define ('_JOMRES_AJAX_SEARCH_COMPOSITE_TEMPLATE_MULTISELECT', "Мултиселектиране (хоризонтална ориентация) само Bootstrap.");
jr_define ('_JOMRES_AJAX_SEARCH_COMPOSITE_SHOWFILTERS', "Показване на филтри");
jr_define ('_JOMRES_AJAX_SEARCH_COMPOSITE_HIDEFILTERS', "Скриване на филтри");


jr_define ('_JOMRES_SHORTCODES_06000AJSCOMPOSITE_INFO', "Използва рамката за търсене на ajax. Позволява ви да поставите модул за търсене, който предлага търсене за наличност, ценови диапазон, характеристики, тип имот, тип стая, номера на гости, звезди, държава, регион и град в странична лента или горната лента. Моля, обърнете внимание, че примерът, показан тук, няма да работи, тъй като някои от аргументите взаимно се анулират, изберете само това, което ви е необходимо от наличните аргументи (с изключение на задължителния аргумент). Този кратък код е малко по -различен от повечето други къси кодове, тъй като трябва да бъдат придружени от специален div след декларацията за кратък код с идентификатор на asamodule_search_results, където приставката поставя върнатия списък със свойства. ");
jr_define ('_JOMRES_SHORTCODES_06000AJSCOMPOSITE_ARG_AJS_PLUGIN', "Задължително. Аргументът трябва да бъде ajax_search_composite ");
jr_define ('_JOMRES_SHORTCODES_06000AJSCOMPOSITE_ARG_STYLE', "Стил на полетата за търсене. Опциите са бутони модални акордеон мултиселекторен. Ако не е зададен, приставката ще използва опцията, конфигурирана в Конфигурацията на сайта. Мултиселектирането/Акордеонът са идеални за хоризонтално показване, другите две опции са най -подходящи за поставяне в странична лента. ");
jr_define ('_JOMRES_SHORTCODES_06000AJSCOMPOSITE_ARG_PROPERTY_DETAILS', "Покажете формуляра за търсене, ако заданието на страницата е настроено на viewproperty (страницата с подробности за собствеността). 0 за Не, 1 за Да.");
jr_define ('_JOMRES_SHORTCODES_06000AJSCOMPOSITE_ARG_PRE_FILTER_PROPERTY_UIDS', "Предварителното филтриране е мястото, където избирате само онези свойства, които отговарят на условието на предварителния филтър, могат да бъдат показани в резултатите от търсенето. Предварително филтрирайте по свойство uid, така че в резултатите от търсенето могат да се показват само някои свойства. разделен със запетая списък на свойствата на свойствата ");
jr_define ('_JOMRES_SHORTCODES_06000AJSCOMPOSITE_ARG_PRE_FILTER_PTYPES', "Предварително филтриране по тип собственост, така че само свойствата на този/тези типове могат да бъдат показани в резултатите от търсенето. Аргументите са списък с разделени със запетая идентификатори на типове свойства.");
jr_define ('_JOMRES_SHORTCODES_06000AJSCOMPOSITE_ARG_PRE_FILTER_COUNTRY', "Предварително филтрирайте по кода на държавата, така че само свойствата в тези държави могат да се показват в резултатите от търсенето. Аргументите са списък с разделени със запетаи кодове на държави по ISO.");
jr_define ('_JOMRES_SHORTCODES_06000AJSCOMPOSITE_ARG_PRE_FILTER_REGION', "Предварително филтриране по име на регион, така че само свойствата в тези региони могат да се показват в резултатите от търсенето. Аргументите са разделени със запетая списък с имената на регионите и трябва да съответстват на регионите, съхранявани в базата данни. Ако сте задали държавата например на Германия (DE), след което имоти от други държави с подобни имена на региони няма да се показват. ");

jr_define ('_JOMRES_SHORTCODES_06000AJSCOMPOSITE_ARG_SHOW_STARS', "Активиране/деактивиране на въвеждането на звезди във формуляра. Имайте предвид, че ако сте задали опция чрез раздела за композитни настройки за търсене на Ajax в Конфигурацията на сайта на Не, тогава настройката asc_by_stars в списъка с аргументи няма да има в списъка с аргументи ефект. ");

jr_define ('_JOMRES_SHORTCODES_06000AJSCOMPOSITE_ARG_SHOW_PRICE', "Активиране/деактивиране на въвеждането на звезди във формуляра. Имайте предвид, че ако сте задали опция чрез раздела за композитни настройки за търсене на Ajax в конфигурацията на сайта на Не, тогава в списъка с аргументи няма да има asc_by_price ефект. ");
jr_define ('_JOMRES_SHORTCODES_06000AJSCOMPOSITE_ARG_SHOW_FEATURES', "Активиране/деактивиране на въвеждането на функциите на свойството във формуляра. Имайте предвид, че ако сте задали опция чрез раздела за композитни настройки за търсене на Ajax в конфигурацията на сайта на Не, тогава настройката asc_by_features ще има без ефект.");
jr_define ('_JOMRES_SHORTCODES_06000AJSCOMPOSITE_ARG_SHOW_COUNTRY', "Активиране/деактивиране на въвеждането на държавата във формуляра. Имайте предвид, че ако сте задали опция чрез раздела за композитни настройки за търсене на Ajax в Конфигурацията на сайта на Не, тогава настройката asc_by_country няма да има в списъка с аргументи ефект. ");
jr_define ('_JOMRES_SHORTCODES_06000AJSCOMPOSITE_ARG_SHOW_REGION', "Активиране/деактивиране на въвеждането на регион във формуляра. Имайте предвид, че ако сте задали опция чрез раздела за композитни настройки за търсене на Ajax в Конфигурацията на сайта на Не, тогава настройката asc_by_region в списъка с аргументи няма да има в списъка с аргументи ефект. ");
jr_define ('_JOMRES_SHORTCODES_06000AJSCOMPOSITE_ARG_SHOW_TOWN', "Активиране/деактивиране на въвеждането на град във формуляра. Имайте предвид, че ако сте задали опция чрез раздела за композитни настройки за търсене на Ajax в Конфигурацията на сайта на Не, тогава настройката asc_by_town в списъка с аргументи няма да има в списъка с аргументи ефект. ");
jr_define ('_JOMRES_SHORTCODES_06000AJSCOMPOSITE_ARG_SHOW_ROOMTYPE', "Активиране/деактивиране на въвеждането на тип стая в формуляра. Имайте предвид, че ако сте задали опция чрез раздела за композитни настройки за търсене на Ajax в конфигурацията на сайта на Не, тогава настройката asc_by_roomtype ще има в списъка с аргументи без ефект.");
jr_define ('_JOMRES_SHORTCODES_06000AJSCOMPOSITE_ARG_SHOW_PROPERTY_TYPE', "Активиране/деактивиране на въвеждането на типа свойство във формуляра. Имайте предвид, че ако сте задали опция чрез раздела за композитни настройки за търсене на Ajax в списъка на параметрите, тогава в списъка на аргументите ще има параметър asc_by_pro без ефект.");
jr_define ('_JOMRES_SHORTCODES_06000AJSCOMPOSITE_ARG_SHOW_GUESTNUMBER', "Активиране/деактивиране на въвеждането на номера за гости във формуляра. Имайте предвид, че ако сте задали опция чрез раздела за композитни настройки за търсене на Ajax в Конфигурацията на сайта на Не, тогава настройката asc_by_guestnumber ще има без ефект.");
jr_define ('_JOMRES_SHORTCODES_06000AJSCOMPOSITE_ARG_SHOW_DATE', "Активиране/деактивиране на въвеждането на дата във формуляра. Имайте предвид, че ако сте задали опция чрез раздела за композитни настройки за търсене на Ajax в конфигурацията на сайта на Не, тогава настройката asc_by_date в списъка с аргументи няма да има ефект. ");