<?php
/**
 * Core file.
 *
 * @author Vince Wooll <sales@jomres.net>
 *
 * @version Jomres 9.24.0
 *
 * @copyright	2005-2021 Vince Wooll
 * Jomres (tm) PHP, CSS & Javascript files are released under both MIT and GPL2 licenses. This means that you can choose the license that best suits your project, and use it accordingly
 **/
//#################################################################
defined('_JOMRES_INITCHECK') or die('');
//#################################################################

jr_define('_OCCUPANCIES_TITLE',"Минимално заетост");

jr_define('_OCCUPANCIES_DESCRIPTION',"Можете да зададете минималните нива на заетост за конкретни типове стаи, ако искате да сте сигурни, че гостът е избрал определен брой типове гости във формуляра за резервация, преди да се покаже подходящата комбинация от стая и тарифа." );
jr_define('_OCCUPANCIES_DESCRIPTION_INFO',"Тук можете да създадете минимално ниво на заетост за всеки тип стая. Комбинация стая/тарифа няма да се предлага, ако гостът не е избрал подходящия брой типове гости. За всеки тип стая, моля, изберете брой гости от даден тип, който трябва да има минимум във формуляра за резервация, преди типът стая да бъде предложен. Ако не ви интересува какво трябва да бъде нивото на заетост за даден тип стая, оставете номера на гостите на този тип стая на 0 (нула). ");
jr_define('_OCCUPANCIES_NUMBER_OF_GUESTTYPE',"Номер тип гост");
jr_define ('_OCCUPANCIES_NO_GUESTTYPES', "Все още нямате създадени типове гости. Моля, създайте някои типове гости, преди да използвате тази функция.");

jr_define('_OCCUPANCIES_EDIT',"Редактиране на минималната заетост за ");