<?php
/**
 * Core file.
 *
 * @author Vince Wooll <sales@jomres.net>
 *
 * @version Jomres 9.24.0
 *
 * @copyright	2005-2021 Vince Wooll
 * Jomres is currently available for use in all personal or commercial projects under both MIT and GPL2 licenses. This means that you can choose the license that best suits your project, and use it accordingly
 **/
//#################################################################
defined('_JOMRES_INITCHECK') or die('');
//#################################################################
jr_define ('_OCCUPANCIES_TITLE', "Ελάχιστες καταλήψεις");

jr_define ('_OCCUPANCIES_DESCRIPTION', "Μπορείτε να ορίσετε τα ελάχιστα επίπεδα πληρότητας για συγκεκριμένους τύπους δωματίων, εάν θέλετε να διασφαλίσετε ότι ο επισκέπτης έχει επιλέξει έναν συγκεκριμένο αριθμό τύπων επισκεπτών στη φόρμα κράτησης πριν εμφανιστεί ο κατάλληλος συνδυασμός δωματίου και τιμολογίου." );
jr_define('_OCCUPANCIES_DESCRIPTION_INFO',"Εδώ μπορείτε να δημιουργήσετε ένα ελάχιστο επίπεδο πληρότητας για κάθε τύπο δωματίου. Δεν θα προσφερθεί συνδυασμός δωματίου/τιμολόγησης εάν ο επισκέπτης δεν έχει επιλέξει τον κατάλληλο αριθμό τύπων επισκεπτών. Για κάθε τύπο δωματίου επιλέξτε το αριθμός επισκεπτών ενός συγκεκριμένου τύπου που θα πρέπει να υπάρχει ελάχιστος στη φόρμα κράτησης πριν προσφερθεί ο τύπος δωματίου. Εάν δεν σας ενδιαφέρει ποιο θα πρέπει να είναι το επίπεδο πληρότητας για έναν τύπο δωματίου, αφήστε τον αριθμό επισκεπτών αυτού του τύπου δωματίου να οριστεί στο 0 (μηδέν). ");
jr_define('_OCCUPANCIES_NUMBER_OF_GUESTTYPE',"Αριθμός τύπου επισκέπτη");
jr_define('_OCCUPANCIES_NO_GUESTTYPES',"Δεν έχετε δημιουργήσει ακόμη τύπους επισκεπτών. Δημιουργήστε μερικούς τύπους επισκεπτών προτού χρησιμοποιήσετε αυτήν τη δυνατότητα.");

jr_define ('_OCCUPANCIES_EDIT', "Επεξεργασία ελάχιστης χωρητικότητας για");