<?php
/**
 * Core file.
 *
 * @author Vince Wooll <sales@jomres.net>
 *
 * @version Jomres 9.24.0
 *
 * @copyright	2005-2021 Vince Wooll
 * Jomres is currently available for use in all personal or commercial projects under both MIT and GPL2 licenses. This means that you can choose the license that best suits your project, and use it accordingly
 **/
//#################################################################
defined('_JOMRES_INITCHECK') or die('');
//#################################################################
jr_define('_OCCUPANCIES_TITLE',"Նվազագույն զբաղվածություն");

jr_define('_OCCUPANCIES_DESCRIPTION',"Դուք կարող եք սահմանել զբաղվածության նվազագույն մակարդակները որոշակի սենյակների տեսակների համար, եթե ցանկանում եք համոզվել, որ հյուրն ընտրել է որոշակի թվով հյուրերի տեսակներ ամրագրման ձևում՝ նախքան համապատասխան սենյակի և սակագների համակցության ցուցադրումը:" );
jr_define('_OCCUPANCIES_DESCRIPTION_INFO',"Այստեղ կարող եք ստեղծել զբաղվածության նվազագույն մակարդակ յուրաքանչյուր սենյակի տեսակի համար: Սենյակ/սակագնի համակցություն չի առաջարկվի, եթե հյուրը չի ընտրել հյուրերի համապատասխան քանակի տեսակը: Յուրաքանչյուր սենյակի համար խնդրում ենք ընտրել տվյալ տեսակի հյուրերի թիվը, որը պետք է լինի նվազագույնը ամրագրման ձևում, նախքան սենյակի տեսակը առաջարկելը: Եթե ձեզ չի հետաքրքրում, թե սենյակի տիպի զբաղվածության մակարդակը պետք է լինի, թողեք այդ սենյակի հյուրի համարը 0: (զրո). ");
jr_define('_OCCUPANCIES_NUMBER_OF_GUESTTYPE',"Հյուրի տեսակի համար");
jr_define('_OCCUPANCIES_NO_GUESTTYPES',"Դուք դեռ չունեք հյուրերի տիպեր ստեղծված: Խնդրում ենք ստեղծել հյուրերի որոշ տեսակներ, նախքան այս հատկությունը օգտագործելը:");

jr_define('_OCCUPANCIES_EDIT',"Խմբագրել նվազագույն զբաղվածությունը ");