<?php
/**
 * Core file.
 *
 * @author Vince Wooll <sales@jomres.net>
 *
 * @version Jomres 9.24.0
 *
 * @copyright	2005-2021 Vince Wooll
 * Jomres (tm) PHP, CSS & Javascript files are released under both MIT and GPL2 licenses. This means that you can choose the license that best suits your project, and use it accordingly
 **/
//#################################################################
defined('_JOMRES_INITCHECK') or die('');
//#################################################################

jr_define('_OCCUPANCIES_TITLE',"Мінімальна кількість людей");

jr_define ('_OCCUPANCIES_DESCRIPTION', "Ви можете встановити мінімальні рівні зайнятості для певних типів номерів, якщо хочете переконатися, що гість вибрав певну кількість типів гостей у формі бронювання, перш ніж буде показано відповідну комбінацію номерів та тарифів." );
jr_define('_OCCUPANCIES_DESCRIPTION_INFO',"Тут ви можете створити мінімальний рівень заповнюваності для кожного типу номерів. Комбінація номер/тариф не буде запропонована, якщо гість не вибрав відповідну кількість типів гостей. Для кожного типу кімнат, будь ласка, виберіть кількість гостей певного типу, яка має бути мінімальною у формі бронювання, перш ніж запропонувати тип номеру. Якщо вам не байдуже, яким має бути рівень заповнюваності для номера, залиште номер гостя цього типу встановленим на 0 (нуль). ");
jr_define('_OCCUPANCIES_NUMBER_OF_GUESTTYPE',"Номер типу гостя");
jr_define('_OCCUPANCIES_NO_GUESTTYPES',"Ви ще не створили жодного типу гостей. Будь ласка, створіть деякі типи гостей, перш ніж використовувати цю функцію.");

jr_define('_OCCUPANCIES_EDIT',"Редагувати мінімальну зайнятість для ");