<?php
/**
 * Core file.
 *
 * @author Vince Wooll <sales@jomres.net>
 *
 * @version Jomres 9.24.0
 *
 * @copyright	2005-2021 Vince Wooll
 * Jomres (tm) PHP, CSS & Javascript files are released under both MIT and GPL2 licenses. This means that you can choose the license that best suits your project, and use it accordingly
 **/
//#################################################################
defined('_JOMRES_INITCHECK') or die('');
//#################################################################


jr_define('WEBHOOKS_AUTH_METHOD_MAILCHIMP', 'Mailchimp');
jr_define( 'WEBHOOKS_AUTH_METHOD_MAILCHIMP_NOTES', 'Цей метод інтеграції оновлює список Mailchimp, коли ви додаєте гостя до системи.<br/>
Вам не потрібно встановлювати введення URL-адреси для цього вебхука, ми з’ясуємо це на основі вашого API.<br/>
Щоб налаштувати цей веб-хук, вам знадобляться два елементи інформації, ключ API та ідентифікатор списку. <br/>
Щоб знайти ключ API, перейдіть до свого облікового запису Mailchimp і :<br/>
<ol>
  <li>Натисніть назву свого профілю, щоб розгорнути панель облікового запису, і виберіть Обліковий запис.</li>
  <li>Натисніть спадне меню "Додатково" та виберіть "Ключі API".</li>
  <li>Скопіюйте наявний ключ API або натисніть кнопку Створити ключ.</li>
  <li>Назвіть свій ключ описово, щоб ви знали, яка програма використовує цей ключ.</li>
</ol>
Далі вам знадобиться ідентифікатор списку, який ви можете знайти, відвідавши свої списки в Mailchimp. Натисніть посилання меню «Списки», а в кінці рядка праворуч клацніть спадне меню, а потім виберіть «Налаштування». Прокрутіть сторінку донизу, там буде щось на кшталт «Ідентифікатор списку для списку блабла». Це ідентифікатор списку, який вам потрібно використовувати.
    ');

jr_define('WEBHOOKS_AUTH_METHOD_MAILCHIMP_APIKEY', 'Ключ API');
jr_define( 'WEBHOOKS_AUTH_METHOD_MAILCHIMP_LISTID', 'Ідентифікатор списку');